docs/1c-export-mobile/MobileAgent/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокДіїЛіцензії</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПросроченийБорг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БоргТзОВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПросроченийБоргТзОВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Область</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Области</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВідділенняНП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Власний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперативныйСтатусКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Маршруты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАсортимета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыАсортимета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаСайт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Геолокация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъмЗаМесяц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияТТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииТТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговыйАгент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеАгенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовоеСообщение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанийВВайбере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактВайбер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактыViber</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейОтПоследнейПокупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПошуку</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналиПошуку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДиалога</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокСесия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Борг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботаСКлиентомПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботаСКлиентомЗапись</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОновлення</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Телефоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>19</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Месенджер</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыМесендеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Маршруты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Маршруты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Асортимент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеРучнаяЗапись</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БанковскиеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АсортиментПрезентацій</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеРучнаяЗапись</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоцМережі</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Коментар</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Посилання</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Мережа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидиСоцМереж</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПосиланняВБраузері</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

docs/1c-export-mobile/MobileAgent/InformationRegisters/РегистрацияИзмененияКонтрагента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>РегистрацияИзмененияКонтрагента</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеСтар</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеНов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОновленняСтар</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОновленняНов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инфо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-mobile/MobileAgent/Catalogs/Контрагенты/Ext/ObjectModule.bsl
Перем мЭтоОбмен Экспорт;



Процедура ПриЗаписи(Отказ)
	
	Если мЭтоОбмен <> Истина Тогда 
		//Если ДополнительныеСвойства.ЭтоНовый Тогда 
			Общий.ЗарегистрироватьИзменения(ЭтотОбъект.Ссылка);
		//КонецЕсли;
	КонецЕсли;

	
КонецПроцедуры


Процедура ПередЗаписью(Отказ)
	Если ЭтоНовый() Тогда
		Если Не ЗначениеЗаполнено(ДатаСоздания) Тогда
			ДатаСоздания = ТекущаяДата();
		КонецЕсли;	
	КонецЕсли;
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
	
	//////////////////////////////                   оновим останню роботу з клієнтом    
	Если НЕ ЭтоНовый() Тогда  
		з = Новый Запрос;
		з.Текст = "ВЫБРАТЬ
		|	РаботаСКлиентомСрезПоследних.Период КАК Период,
		|	РаботаСКлиентомСрезПоследних.Запись КАК Запись
		|ИЗ
		|	РегистрСведений.РаботаСКлиентом.СрезПоследних(, Клиент = &Клиент) КАК РаботаСКлиентомСрезПоследних";
		з.УстановитьПараметр("Клиент", Ссылка);
		Виборка = з.Выполнить().Выбрать();
		
		
		Если Виборка.Следующий() Тогда 
			РаботаСКлиентомПериод =  Виборка.Период;
			РаботаСКлиентомЗапись = Виборка.Запись;
		иначе
			РаботаСКлиентомПериод =  '00010101';
			РаботаСКлиентомЗапись = "";		
		КонецЕсли;
		КонтрольВерсийПерезапису();
	КонецЕсли;
	
	Общий.ЗарегистрироватьИзмененияКонтрагента(Ссылка, Ссылка.Наименование, Наименование, Ссылка.ДатаОновлення, ДатаОновлення);

КонецПроцедуры

Процедура КонтрольВерсийПерезапису()
	Если НЕ ЭтоНовый() И Ссылка.ДатаОновлення > ДатаОновлення Тогда 
		СтрСохр = Новый Структура;
		СтрСохр.Вставить("РаботаСКлиентомПериод", РаботаСКлиентомПериод);
		СтрСохр.Вставить("РаботаСКлиентомЗапись", РаботаСКлиентомЗапись);
		СтрСохр.Вставить("Борг", Борг);
		СтрСохр.Вставить("ОстатокСесия", ОстатокСесия);
		СтрСохр.Вставить("СтатусДиалога", СтатусДиалога);
		СтрСохр.Вставить("КоличествоДнейОтПоследнейПокупки", КоличествоДнейОтПоследнейПокупки);
		СтрСохр.Вставить("КонтактВайбер", КонтактВайбер);
		СтрСохр.Вставить("ПодписанийВВайбере", ПодписанийВВайбере);
		СтрСохр.Вставить("НовоеСообщение", НовоеСообщение);
		
			
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Ссылка);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтрСохр);
		ЭтотОбъект.Наименование = Ссылка.Наименование;
		
		Телефоны.Очистить();
		Для Каждого Стр Из Ссылка.Телефоны Цикл
			НовСтр = Телефоны.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЦикла;
		
		Маршруты.Очистить();
		Для Каждого Стр Из Ссылка.Маршруты Цикл
			НовСтр = Маршруты.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЦикла;
		
		Асортимент.Очистить();
		Для Каждого Стр Из Ссылка.Асортимент Цикл
			НовСтр = Асортимент.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЦикла;

		БанковскиеСчета.Очистить();
		Для Каждого Стр Из Ссылка.БанковскиеСчета Цикл
			НовСстр = БанковскиеСчета.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЦикла;

		АсортиментПрезентацій.Очистить();
		Для Каждого Стр Из Ссылка.АсортиментПрезентацій Цикл
			НовСтр = АсортиментПрезентацій.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЦикла;		
		
	КонецЕсли;
	
	з = Новый Запрос;
	з.Текст = "ВЫБРАТЬ
	          |	РегистрацияИзмененияКонтрагента.НаименованиеНов КАК НаименованиеНов
	          |ИЗ
	          |	РегистрСведений.РегистрацияИзмененияКонтрагента КАК РегистрацияИзмененияКонтрагента
	          |ГДЕ
	          |	РегистрацияИзмененияКонтрагента.Контрагент = &Контрагент
	          |	И (РегистрацияИзмененияКонтрагента.НаименованиеСтар = &Наименование
	          |			ИЛИ РегистрацияИзмененияКонтрагента.НаименованиеНов = &Наименование)";
	з.УстановитьПараметр("Контрагент", Ссылка);
	з.УстановитьПараметр("Наименование", Наименование);
	Выборка = з.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Наименование = Ссылка.Наименование; 
	КонецЕсли;
	
	
	
	
КонецПроцедуры


Процедура ОновитиСтатусиЗакаів(Ответ) Экспорт 
	Ответ = Новый Структура;
	Ответ.Вставить("Успех", Истина);
	
	Пароль = Константы.ПарольВхода.Получить();
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("Контрагент", Ссылка.УникальныйИдентификатор());

	Данные = Новый Структура;
	Данные.Вставить("Команда", "ПолучитьСтатусыЗаказовПоКонтрагенту");
	Данные.Вставить("Параметры", ПараметрыКоманды);
	
	Попытка 
		Прокси = СоединениеСБазой.ПолучитьПрокси();
		СтруктураОтветаПоЗаказам = Прокси.ВыполнитьКоманду(Пароль, Обмен_УправлениеОбменом.Сериализовать(Данные)).Получить();
	Исключение
		СтруктураОтветаПоЗаказам = Новый Структура;
		СтруктураОтветаПоЗаказам.Вставить("Успешно", Ложь);
		СтруктураОтветаПоЗаказам.Вставить("Ошибка", ОписаниеОшибки());
	КонецПопытки;

	Если Не СтруктураОтветаПоЗаказам.Успешно Тогда
		Ответ.Вставить("СтруктураОтветаПоЗаказам",Ложь);
		Ответ.Вставить("Ошибка", СтруктураОтветаПоЗаказам.Ошибка);
		Возврат;
	КонецЕсли;
	
	ТЗАктуальныхЗаказов = СтруктураОтветаПоЗаказам.Данные;	
	
	ТЗАктуальныхЗаказов.Колонки.Добавить("Заказ");

	Для Каждого стрОтчета Из ТЗАктуальныхЗаказов Цикл
		стрОтчета.Заказ = Документы.Заказ.ПолучитьСсылку(стрОтчета.УИДЗаказ);
		Если Общий.ОбъектБДСуществует(стрОтчета.Заказ) Тогда
			Если Не стрОтчета.Заказ.Актуальный = стрОтчета.Актуальный Тогда 
				ЗаказДляОбрабткиОбъект = стрОтчета.Заказ.ПолучитьОбъект();			
				ЗаказДляОбрабткиОбъект.Актуальный = стрОтчета.Актуальный;
				ЗаказДляОбрабткиОбъект.Записать(РежимЗаписиДокумента.Запись);	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;	

	
КонецПроцедуры
